#include<iostream>
using namespace std;
int main()
{
	//数组定义

	/*
	1|数据类型  数组名[ 数组长度 ]；
	2、数据类型  数组名[ 数组长度 ] = {值1，值2，…}；
	3、数据类型  数组名[ ] = {值1，值2，…}；
	*/

	////第一种
	//int arr[5];
	//arr[0] = 1;
	//arr[1] = 2;
	//arr[2] = 3;
	//arr[3] = 4;
	//arr[4] = 5;

	////访问数据元素
	//cout << arr[0] << endl;

	////第二种,如果数组中的元素个数不足时，会用0进行填补剩余的数据
	//int arr2[5] = { 10,20,30,40,50 };

	////利用循环输出数组中的元素
	//for (int i = 0; i < 5; i++)
	//{
	//	cout << arr2[i] << endl;
	//}
	
	//第三种，数据类型  数组名[ ] = {值1，值2，…}；
	int arr3[ ] = { 10, 20, 30, 40, 50 };
	for (int i = 0; i < 5; i++)
	{
		cout << arr3[i] << endl;
	}


	system("pause");

	return 0;
}